# 1. Створити 2 змінні з однаковими даними
# (і однаковим типом) та з однаковими ідентифікаторами
# (не присвоюючи значення змінних один одному)

a_1 = 22
a_2 = 5+6+5+6
print('1)\n', a_1 == a_2, sep='')
print(a_1 is a_2)
print('a_1', type(a_1))
print('a_2', type(a_2))

print('-' * 50)
# 2. Створити 2 змінні з однаковими даними
# (і однаковим типом) та з різними ідентифікаторами

b_1 = [5, 'f', 77]
b_2 = [5, 'f', 77]
print('2)\n', b_1 == b_2, sep='')
print (b_1 is b_2)
print('b_1', type(b_1))
print('b_2', type(b_2))

print('-' * 50)
# 3 *Додаткове необов'язкове завдання:

c_1 = list(str(a_1))
c_2 = list(str(a_2))
print('3)\n',c_1 == c_2, sep='')
print(c_1 is c_2)
print('c_1', type(c_1))
print('c_2', type(c_2))

print('-' * 10)

d_1 = int(b_1[0])
d_2 = int(b_2[0])
print(d_1 == d_2)
print(d_1 is d_2)
print('d_1', type(d_1))
print('d_2', type(d_2))

